МПР/src/Enums/ДниНедели/ДниНедели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДниНедели</name>
  <enumValues>
    <name>Понедельник</name>
  </enumValues>
  <enumValues>
    <name>Вторник</name>
  </enumValues>
  <enumValues>
    <name>Среда</name>
  </enumValues>
  <enumValues>
    <name>Четверг</name>
  </enumValues>
  <enumValues>
    <name>Пятница</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Enums/ОсобенностиУчетаНоменклатуры/ОсобенностиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОсобенностиУчетаНоменклатуры</name>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>БезОсобенностейУчета</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>КиЗГИСМ</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ОбувнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
</mdclass:Enum>

МПР/src/CommonModules/ОбщегоНазначенияРМККлиентСерверПовтИсп/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает представление валюты.
//
// Возвращаемое значение:
//  Строка - представление валюты.
//
Функция ВалютаРубли() Экспорт
	Возврат НСтр("ru = 'руб.'");
КонецФункции

// Возвращает день недели по дате 
//
// Параметры:
//  Дата - Дата - дата, по которой определяется значение дня
//
// Возвращаемое значение:
//  Результат - ПеречислениеСсылка.ДниНедели
//
Функция ДеньНеделиПеречислением(Дата) Экспорт

	НачалоЛитералаДняНедели = "Перечисление.ДниНедели.";
	ДополнениеЛитералаДняНедели = "ПустаяСсылка";
	
	Если ЗначениеЗаполнено(Дата) Тогда
	
		ДеньНеделиЧислом = ДеньНедели(Дата);
		
		Если ДеньНеделиЧислом = 1 Тогда
			ДополнениеЛитералаДняНедели = "Понедельник";
		ИначеЕсли ДеньНеделиЧислом = 2 Тогда
			ДополнениеЛитералаДняНедели = "Вторник";
		ИначеЕсли ДеньНеделиЧислом = 3 Тогда
			ДополнениеЛитералаДняНедели = "Среда";
		ИначеЕсли ДеньНеделиЧислом = 4 Тогда
			ДополнениеЛитералаДняНедели = "Четверг";
		ИначеЕсли ДеньНеделиЧислом = 5 Тогда
			ДополнениеЛитералаДняНедели = "Пятница";
		ИначеЕсли ДеньНеделиЧислом = 6 Тогда
			ДополнениеЛитералаДняНедели = "Суббота";
		ИначеЕсли ДеньНеделиЧислом = 7 Тогда
			ДополнениеЛитералаДняНедели = "Воскресенье";
		Иначе
			ДополнениеЛитералаДняНедели = "ПустаяСсылка";
		КонецЕсли;
	
	КонецЕсли;
	
	ПолноеИмяЛитерала = СтрШаблон("%1%2", НачалоЛитералаДняНедели, ДополнениеЛитералаДняНедели);
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(ПолноеИмяЛитерала);
	
КонецФункции

// Возвращает перечень маркируемой продукции, оборот которой фиксируется в ИС МП.
//
// Параметры:
//  ВключатьТабачнуюПродукцию - Булево - Признак включения табачной продукции
//  ВключатьМолочнуюПродукцию - Булево - Признак включения молочной продукции подконтрольной ВетИС
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры - список видов маркируемой продукции ИСМП.
//
Функция ВидыМаркируемойПродукции(ВключатьТабачнуюПродукцию = Истина, ВключатьМолочнуюПродукцию = Истина) Экспорт
	
	ВидыМаркируемойПродукции = Новый Массив();
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция"));
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность"));
	
	Если ВключатьМолочнуюПродукцию Тогда
		ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
			"Перечисление.ОсобенностиУчетаНоменклатуры.МолочнаяПродукция"));
	КонецЕсли;
	
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.Фотоаппараты"));
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.Велосипеды"));
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.КреслаКоляски"));
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.Шины"));
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.Духи"));
	ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.УпакованнаяВода"));
	
	Если ВключатьТабачнуюПродукцию Тогда
		
		ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
			"Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция"));
		ВидыМаркируемойПродукции.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
			"Перечисление.ОсобенностиУчетаНоменклатуры.АльтернативныйТабак"));
		
	КонецЕсли;
	
	Возврат ВидыМаркируемойПродукции;
	
КонецФункции

// Возвращает перечень подакцизной продукции.
//
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры - список видов маркируемой продукции ИСМП.
//
Функция ВидыПодакцизнойНоменклатуры() Экспорт

	Результат = Новый Массив();
	Результат.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция"));
	Результат.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
			"Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция"));
	Результат.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
			"Перечисление.ОсобенностиУчетаНоменклатуры.АльтернативныйТабак"));
	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
